function K = Kostberechen(A,C,D,t,c,e,w,H) %成本计算，ga中的适应性函数
%% 基本思路
%订货的周期固定，一次订货满足一个周期的生产需要。
%一共生产255天
%H为每类的订货间隔，根据供货周期进行分类，共7类
%每日库存是根据每日消耗相应减少的，库存变化：w*H*2+w*(H-1)*...w*1
%每类运输成本为订货次数乘每次的成本，然后7类相加

%% 成本计算
[NIND, N]= size(H);
K = zeros(NIND,1);
u = [7 15 30 45 60 120 160];    %每类的最低订货周期，低于这个周期则会产生缺货
for i = 1:NIND
    %% 各参数初始化
    J = 0;
    d = zeros(1,N);
    E = 0;
    v = zeros(1,N);
    j = zeros(1,N);
    p = zeros(N,1);
    T = 0;
    %% 计算库存成本
    for y = 1:N  
        p(y) = 255/H(i,y);    %每类的订货次数
        if H(i,y) >=  u(y)      %如果不缺货
                for b = 1:H(i,y)
                    w(y) = H(i,y) - u(y);
                    d(y) = w(y)*e(y)*(H(i,y)+w(y)+1-b)+d(y);
                end
        else                    %如果缺货
            %v(y) = u(y)-H(i,y);
            %j(y) = 70*8*v(y)*(p(y)-1);      %各类加班的人力成本
            j(y) = 0.01*C;
            J = j(y)+J;                 %总加班成本
                for b = 1:H(i,y)
                    d(y) = w(y)*e(y)*(H(i,y)-b)+d(y);
                end
        end
        E = d(y)*p(y)+E;        %总库存成本
    %% 订单成本计算，t为各类的运输成本；c为工人小时工资，这里假设一次订货需要2人，一小时。
    
        T = p(y)*(t(y)+2*c) + T;   %订货成本加和

     end 
    K(i,1) = A + T + C + D + E + J;    %总成本加和
end